DEFINE PROGRAM(ZSRV02) GROUP(CICSJADP)
       RELOAD(NO) RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO)
       STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW) EXECKEY(USER)
       CONCURRENCY(QUASIRENT) DYNAMIC(NO) EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE TRANSACTION(ACTO) GROUP(CICSJADP)
DESCRIPTION(TRAN FOR ACCOUNTOBJECT IIOP REQUESTS)
       PROGRAM(DFHIIOPA) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(NO) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) ACTION(BACKOUT) WAIT(YES) WAITTIME(0,0,0)
       RESSEC(NO) CMDSEC(NO)
DEFINE TRANSACTION(CIOF) GROUP(CICSJADP)
DESCRIPTION(CICS Generic factory started by CIOR)
       PROGRAM(DFHIIOPA) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(ENABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(YES) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) ACTION(BACKOUT) WAIT(YES) WAITTIME(0,0,0)
       RESSEC(NO) CMDSEC(NO)
DEFINE REQUESTMODEL(ACCTRM) GROUP(CICSJADP)
DESCRIPTION(Account Object for CICS Primer)
       OMGMODULE(accountObject) OMGINTERFACE(AccountInterface*)
       OMGOPERATION(*) TRANSID(ACTO)
DEFINE REQUESTMODEL(DEFAULT) GROUP(CICSJADP)
DESCRIPTION(Generic factory)
       OMGMODULE(org::omg::CosLifeCycle) OMGINTERFACE(GenericFactory)
       OMGOPERATION(*) TRANSID(CIOF)
DEFINE TCPIPSERVICE(PRMTCPIP) GROUP(CICSJADP)
DESCRIPTION(TEST)
       PORTNUMBER(32661) STATUS(OPEN) SSL(NO) TRANSACTION(CIOR)
       BACKLOG(5) SOCKETCLOSE(NO)
