DEFINE FILE(ACCTFIL) GROUP(NACT0GRP)
DESCRIPTION(MAIN ACCOUNT FILE)
       DSNAME(high.level.qualifier.ACCTFILE) RLSACCESS(YES) LSRPOOLID(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       RECORDSIZE(383) KEYLENGTH(5) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
       RECORDFORMAT(F) ADD(YES) BROWSE(NO) DELETE(YES) READ(YES)
       UPDATE(YES) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
       JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE)
       FWDRECOVLOG(NO) BACKUPTYPE(STATIC)
DEFINE FILE(ACCTNAM) GROUP(NACT0GRP)
DESCRIPTION(AIX PATH TO MAIN ACCOUNT FILE)
       DSNAME(high.level.qualifier.ACCTNAME) RLSACCESS(YES) LSRPOOLID(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(F) ADD(NO)
       BROWSE(YES) DELETE(NO) READ(YES) UPDATE(NO) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC)
DEFINE FILE(ACINUSE) GROUP(NACT0GRP)
DESCRIPTION(LOCK FILE)
       DSNAME(high.level.qualifier.ACTINUSE) RLSACCESS(YES) LSRPOOLID(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       RECORDSIZE(25) KEYLENGTH(5) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(10000) UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V)
       ADD(YES) BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES)
       JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO)
       JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC)
DEFINE MAPSET(NACTSET) GROUP(NACT0GRP)
       RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
DEFINE PROGRAM(NACT01) GROUP(NACT0GRP)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
       EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE PROGRAM(NACT02) GROUP(NACT0GRP)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
       EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE PROGRAM(NACT03) GROUP(NACT0GRP)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
       EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE PROGRAM(NACT04) GROUP(NACT0GRP)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
       EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE PROGRAM(NACT05) GROUP(NACT0GRP)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
       EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE TRANSACTION(NACP) GROUP(NACT0GRP)
DESCRIPTION(THE PRINT PROGRAM)
       PROGRAM(NACT03) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(NO) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) ACTION(BACKOUT) WAIT(YES) WAITTIME(0,0,0)
       RESSEC(NO) CMDSEC(NO)
DEFINE TRANSACTION(NACT) GROUP(NACT0GRP)
       PROGRAM(NACT01) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(NO) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) ACTION(BACKOUT) WAIT(YES) WAITTIME(0,0,0)
       RESSEC(NO) CMDSEC(NO)
