        PCB     TYPE=DB,DBDNAME=USRSCN,PROCOPT=GO,KEYLEN=32
        SENSEG  NAME=CUSTADDR,PARENT=0
        SENSEG  NAME=TOTUSE,PARENT=CUSTADDR
        SENSEG  NAME=PRMUSE,PARENT=TOTUSE
        SENSEG  NAME=OFFUSE,PARENT=TOTUSE
        SENSEG  NAME=OFFDTL,PARENT=OFFUSE
        SENSEG  NAME=BALDUE,PARENT=CUSTADDR
        SENSEG  NAME=BALHIST,PARENT=BALDUE
        PSBGEN  LANG=COBOL,PSBNAME=ISCANPSB                             00030000
        END