/* My first REXX Script - using RDz */
do RDz1 = 1 to 10
   square.RDz1 = RDz1 * RDz1
end RDz1

do RDz2 = 1 to 10
   say "squared."RDz2 "is:" square.RDz2
end RDz2
