001900     SELECT SORT-WORK-FILE    ASSIGN TO UT-S-SORTFILE.
004600 FD  SORT-WORK-FILE
004800     DATA RECORD IS SORT-WORK-REC.
004900 01  SORT-WORK-REC.
035300     SORT SORT-WORK-FILE
035400         ASCENDING KEY SWF-PARTNO
035500             INPUT  PROCEDURE 220-INPUT-PROCEDURE
035600             OUTPUT PROCEDURE 250-OUTPUT-PROCEDURE.
035700 200-EXIT.
035800     EXIT.
035900*
036000*
036100*
036200 220-INPUT-PROCEDURE SECTION.
036300     PERFORM 222-SELECT-RECS  THRU 222-EXIT
036400         UNTIL EOF-ACT.
036500 220-EXIT-IP SECTION.
036600 *
036700 222-SELECT-RECS.
036800     PERFORM 230-EDITS THRU 230-EXIT
036900     IF RECORD-VALID THEN
037000         PERFORM 232-LOOKUP-MODEL THRU
037100         IF MODEL-FOUND THEN
037200             PERFORM 233-PREP-SRT-REC         THRU 233-EXIT
037300             PERFORM 240-RELEASE-ACTIVITY-REC THRU 240-EXIT
037400         ELSE
037500             DISPLAY 'MODEL NOT FOUND - ' WS-CUR-ACT-REC
037600             ADD 1 TO AC-ACT-BYPASS
037700     ELSE
037800         DISPLAY RC-ERR-MSG WS-CUR-ACT-REC
037900         ADD 1 TO AC-ACT-BYPASS.
038000     PERFORM 229-READ-ACTIVITY THRU 229-EXIT.
038100 222-EXIT.
038200     EXIT.
038300*
038400 229-READ-ACTIVITY.
038500     READ CUR-ACT-FILE-IN
038600         INTO WS-CUR-ACT-REC
038700             AT END MOVE 'Y' TO SW-EOF-ACT.
038800     IF NOT EOF-ACT THEN
038900         ADD 1 TO AC-ACT-IN.
039000 229-EXIT.
039100     EXIT.
039200*
039300 230-EDITS.
039400     MOVE 'Y' TO SW-VALID.
039500     IF AF-QTY NOT NUMERIC OR AF-AMT NOT NUMERIC THEN
039600         MOVE 'N' TO SW-VALID
039700         MOVE 'RECORD IN ERROR-INVALID AMT/QTY:  TO RC-ERR-MSG
039800         GO TO 230-EXIT.
039900     IF AF-REC-PAY-CODE = 'P' OR AF-REC-PAY-CODE = 'R' THEN
040000         NEXT SENTENCE
040100     ELSE
040200         MOVE 'N' TO SW-VALID
040300         MOVE 'RECORD IN ERROR-INVALID CODE:    ' TO RC-ERR-MSG.
040400 230-EXIT.
040500     EXIT.
040600*
040700 232-LOOKUP-MODEL.
040800     MOVE 'Y' TO SW-FOUND.
040900     SET PROD-NDX TO 1.
041000     SEARCH PROD-LINE-TBL
041100         AT END MOVE N TO SW-FOUND
041200         WHEN AF-PROD-LINE = PLT-PROD-LINE (PROD-NDX)
041300             MOVE PLT-MODEL (PROD-NDX) TO SWF-MODEL.
041400 232-EXIT.
041500     EXIT.
041600*
041700 233-PREP-SRT-REC.
041800     IF MODEL-FOUND THEN
041900         MOVE AF-PARTNO       TO SWF-PARTNO
042000         MOVE AF-REST-OF-REC  TO SWF-REST-OF-REC
042100         MOVE AF-REC-PAY-CODE TO SWF-REC-PAY-CODE
042200     ELSE
042300         DISPLAY 'NAME NOT FOUND IN TBL - ' WS-CUR-ACT-REC.
042400 233-EXIT.
042500     EXIT.
042600*
042700 240-RELEASE-ACTIVITY-REC.
042800     RELEASE SORT-WORK-REC.
057800     RETURN SORT-WORK-FILE 