 DCL 01 DFHEIBLK,
  02  EIBAID CHAR(1),
  02  EIBCALEN FIXED BIN(15),
  02  EIBCPOSN FIXED BIN(15),
  02  EIBDATE FIXED DEC(7,0),
  02  EIBDS CHAR(8),
  02  EIBFN CHAR(2),
  02  EIBRCODE CHAR(6),
  02  EIBREQID CHAR(8),
  02  EIBRESP FIXED BIN(31),
  02  EIBRESP2 FIXED BIN(31),
  02  EIBRLDBK CHAR(1),
  02  EIBRSRCE CHAR(8),
  02  EIBTASKN FIXED DEC(7,0),
  02  EIBTIME FIXED DEC(7,0),
  02  EIBTRMID CHAR(4),
  02  EIBTRNID CHAR(4);