     DECLARE 1 EPSP1MI AUTOMATIC UNALIGNED,
          2  DFHMS1 CHARACTER (12),
          2  EPBDAYL    FIXED BINARY (15,0),
          2  EPBDAYF    CHARACTER (1),
          2  DFHMS2 CHARACTER (2),
          2  EPBDAYI  CHARACTER (8),
          2  EPBDAYML    FIXED BINARY (15,0),
          2  EPBDAYMF    CHARACTER (1),
          2  DFHMS3 CHARACTER (2),
          2  EPBDAYMI  CHARACTER (8),
          2  EPBDAYIL    FIXED BINARY (15,0),
          2  EPBDAYIF    CHARACTER (1),
          2  DFHMS4 CHARACTER (2),
          2  EPBDAYII  CHARACTER (1),
          2  EPBDAYDL    FIXED BINARY (15,0),
          2  EPBDAYDF    CHARACTER (1),
          2  DFHMS5 CHARACTER (2),
          2  EPBDAYDI  CHARACTER (45),
          2  EPBDAYRL    FIXED BINARY (15,0),
          2  EPBDAYRF    CHARACTER (1),
          2  DFHMS6 CHARACTER (2),
          2  EPBDAYRI  CHARACTER (45),
          2  EPBDFMTL    FIXED BINARY (15,0),
          2  EPBDFMTF    CHARACTER (1),
          2  DFHMS7 CHARACTER (2),
          2  EPBDFMTI  CHARACTER (45),
          2  EPBDFM1L    FIXED BINARY (15,0),
          2  EPBDFM1F    CHARACTER (1),
          2  DFHMS8 CHARACTER (2),
          2  EPBDFM1I  CHARACTER (24),
          2  EPBDFM2L    FIXED BINARY (15,0),
          2  EPBDFM2F    CHARACTER (1),
          2  DFHMS9 CHARACTER (2),
          2  EPBDFM2I  CHARACTER (29),
          2  EPDIFF1L    FIXED BINARY (15,0),
          2  EPDIFF1F    CHARACTER (1),
          2  DFHMS10 CHARACTER (2),
          2  EPDIFF1I  CHARACTER (24),
          2  EPDIFF2L    FIXED BINARY (15,0),
          2  EPDIFF2F    CHARACTER (1),
          2  DFHMS11 CHARACTER (2),
          2  EPDIFF2I  CHARACTER (9),
          2  EPDIFF3L    FIXED BINARY (15,0),
          2  EPDIFF3F    CHARACTER (1),
          2  DFHMS12 CHARACTER (2),
          2  EPDIFF3I  CHARACTER (4),
          2  EPBRETL    FIXED BINARY (15,0),
          2  EPBRETF    CHARACTER (1),
          2  DFHMS13 CHARACTER (2),
          2  EPBRETI  CHARACTER (27),
          2  EPRET1L    FIXED BINARY (15,0),
          2  EPRET1F    CHARACTER (1),
          2  DFHMS14 CHARACTER (2),
          2  EPRET1I  CHARACTER (26),
          2  EPRET2L    FIXED BINARY (15,0),
          2  EPRET2F    CHARACTER (1),
          2  DFHMS15 CHARACTER (2),
          2  EPRET2I  CHARACTER (35),
          2  MSGOUTL    FIXED BINARY (15,0),
          2  MSGOUTF    CHARACTER (1),
          2  DFHMS16 CHARACTER (2),
          2  MSGOUTI  CHARACTER (58),
          2  MSGERRL    FIXED BINARY (15,0),
          2  MSGERRF    CHARACTER (1),
          2  DFHMS17 CHARACTER (2),
          2  MSGERRI  CHARACTER (40),
          2 FILL0093  CHARACTER (1);
     DECLARE 1 EPSP1MO BASED(ADDR(EPSP1MI)) UNALIGNED,
           2  DFHMS18 CHARACTER (12),
          2  DFHMS19 FIXED BINARY (15,0),
          2  EPBDAYA    CHARACTER (1),
          2  EPBDAYC    CHARACTER (1),
          2  EPBDAYH    CHARACTER (1),
          2  EPBDAYO  CHARACTER (8),
          2  DFHMS20 FIXED BINARY (15,0),
          2  EPBDAYMA    CHARACTER (1),
          2  EPBDAYMC    CHARACTER (1),
          2  EPBDAYMH    CHARACTER (1),
          2  EPBDAYMO  CHARACTER (8),
          2  DFHMS21 FIXED BINARY (15,0),
          2  EPBDAYIA    CHARACTER (1),
          2  EPBDAYIC    CHARACTER (1),
          2  EPBDAYIH    CHARACTER (1),
          2  EPBDAYIO  CHARACTER (1),
          2  DFHMS22 FIXED BINARY (15,0),
          2  EPBDAYDA    CHARACTER (1),
          2  EPBDAYDC    CHARACTER (1),
          2  EPBDAYDH    CHARACTER (1),
          2  EPBDAYDO  CHARACTER (45),
          2  DFHMS23 FIXED BINARY (15,0),
          2  EPBDAYRA    CHARACTER (1),
          2  EPBDAYRC    CHARACTER (1),
          2  EPBDAYRH    CHARACTER (1),
          2  EPBDAYRO  CHARACTER (45),
          2  DFHMS24 FIXED BINARY (15,0),
          2  EPBDFMTA    CHARACTER (1),
          2  EPBDFMTC    CHARACTER (1),
          2  EPBDFMTH    CHARACTER (1),
          2  EPBDFMTO  CHARACTER (45),
          2  DFHMS25 FIXED BINARY (15,0),
          2  EPBDFM1A    CHARACTER (1),
          2  EPBDFM1C    CHARACTER (1),
          2  EPBDFM1H    CHARACTER (1),
          2  EPBDFM1O  CHARACTER (24),
          2  DFHMS26 FIXED BINARY (15,0),
          2  EPBDFM2A    CHARACTER (1),
          2  EPBDFM2C    CHARACTER (1),
          2  EPBDFM2H    CHARACTER (1),
          2  EPBDFM2O  CHARACTER (29),
          2  DFHMS27 FIXED BINARY (15,0),
          2  EPDIFF1A    CHARACTER (1),
          2  EPDIFF1C    CHARACTER (1),
          2  EPDIFF1H    CHARACTER (1),
          2  EPDIFF1O  CHARACTER (24),
          2  DFHMS28 FIXED BINARY (15,0),
          2  EPDIFF2A    CHARACTER (1),
          2  EPDIFF2C    CHARACTER (1),
          2  EPDIFF2H    CHARACTER (1),
          2  EPDIFF2O  CHARACTER (9),
          2  DFHMS29 FIXED BINARY (15,0),
          2  EPDIFF3A    CHARACTER (1),
          2  EPDIFF3C    CHARACTER (1),
          2  EPDIFF3H    CHARACTER (1),
          2  EPDIFF3O  CHARACTER (4),
          2  DFHMS30 FIXED BINARY (15,0),
          2  EPBRETA    CHARACTER (1),
          2  EPBRETC    CHARACTER (1),
          2  EPBRETH    CHARACTER (1),
          2  EPBRETO  CHARACTER (27),
          2  DFHMS31 FIXED BINARY (15,0),
          2  EPRET1A    CHARACTER (1),
          2  EPRET1C    CHARACTER (1),
          2  EPRET1H    CHARACTER (1),
          2  EPRET1O  CHARACTER (26),
          2  DFHMS32 FIXED BINARY (15,0),
          2  EPRET2A    CHARACTER (1),
          2  EPRET2C    CHARACTER (1),
          2  EPRET2H    CHARACTER (1),
          2  EPRET2O  CHARACTER (35),
          2  DFHMS33 FIXED BINARY (15,0),
          2  MSGOUTA    CHARACTER (1),
          2  MSGOUTC    CHARACTER (1),
          2  MSGOUTH    CHARACTER (1),
          2  MSGOUTO  CHARACTER (58),
          2  DFHMS34 FIXED BINARY (15,0),
          2  MSGERRA    CHARACTER (1),
          2  MSGERRC    CHARACTER (1),
          2  MSGERRH    CHARACTER (1),
          2  MSGERRO  CHARACTER (40),
          2 FILL0093  CHARACTER (1);
    /* END OF MAP DEFINITION */