*PROCESS;
 REGI0CP: /* PRINT THANK YOU LINE */
          PROC (POTVSAM_REC) REORDER;
          /*-------------------------------------------------------*/
          /*                                                       */
          /*-------------------------------------------------------*/

          /*-------------------------------------------------------*/
          /*  PARAMETERS                                           */
          /*-------------------------------------------------------*/
          DCL 1 POTVSAM_REC,
          %INCLUDE POTVSAM ;;
          /*-------------------------------------------------------*/
          /*  WORKING STORAGE                                      */
          /*-------------------------------------------------------*/
          DCL MESSAGE         CHAR(80) INIT ('');

          /*-------------------------------------------------------*/
          /*  MAIN PROCESS                                         */
          /*-------------------------------------------------------*/

          MESSAGE = 'THANK YOU '
                    || CUST_FN
                    || ' '
                    || CUST_LN
                    || ' FOR ATTENDING THIS DEMO'  ;

          PUT SKIP EDIT(MESSAGE) (A);

          END ; /* REGI0CP */